Revit 2026 API

# ModuleStatus Enumeration

---

The Macro module status.

**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPIMacros (in RevitAPIMacros.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ModuleStatus
```
```vb
Public Enumeration ModuleStatus
```
```cpp
public enum class ModuleStatus
```
```fsharp
type ModuleStatus
```

| Member name | Value | Description |
| --- | --- | --- |
| BuildFailed | 1 | Failed to build the module. |
| Corrupt | 4 | The module is corrupt. |
| Disabled | 3 | The module is disabled. |
| Loaded | 0 | The module is loaded. |
| LoadFailed | 2 | Failed to load the module. |
| NotBuild | 5 | The module is not build. |

#### Reference

Autodesk.Revit.DB.Macros Namespace